/*------------------------------------------------------------------------------
        Заголовки
-------------------------------------------------------------------------------*/
#include <iostream>
#include "parsing.h"

/*------------------------------------------------------------------------------
        Локальные определения
-------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
        Глобальные переменные
-------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
        Внешние переменные
-------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
        Локальные переменные
-------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
        Локальные функции (объявления)
-------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
        Локальные функции (реализация)
-------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
        Глобальные функции
-------------------------------------------------------------------------------*/
int main()
{
    system("chcp 1251");
    TaskManager myList;
    Command cmd;
    string command;

    cout << "Добро пожаловать в To-Do List!\n";

    myList.loadList(AUTO_SAVE_NAME_FILE);

    while (1)
    {
        cout << "\nВведите команду (help - список доступных команд): ";

        //Ввод команды
        getline(cin, command);

        //Функция парсинга введенной строки
        cmd = parsingInputCmd(command);

        //Выполнение каждой из команд
        if (cmd.nameCommand == "add")
            myList.addTask(cmd.task);
        else if (cmd.nameCommand == "find")
            myList.findTask(cmd.task);
        else if (cmd.nameCommand == "complete")
            myList.markComplete(atoll(cmd.stringId.c_str()));
        else if (cmd.nameCommand == "clear")
            myList.clearTask(cmd.status);
        else if (cmd.nameCommand == "remove")
            myList.removeTask(atoll(cmd.stringId.c_str()));
        else if (cmd.nameCommand == "list")
            myList.printTasks(cmd.status);
        else if (cmd.nameCommand == "help")
        {
            cout << "\nСписок доступных команд:\n";
            cout << "add \"Заголовок задачи\" --priority=high/middle/low - Добавить задачу и ее приоритет;\n";
            cout << "complete \"Номер задачи\" - Отметить задачу как выполненную;\n";
            cout << "edit \"Номер задачи\" - Изменить задачу.\n";
            cout << "save \"Имя файла\" - Сохранинить список;\n";
            cout << "load \"Имя файла\" - Загрузить список;\n";
            cout << "find \"Слово\" - Поиск задач по слову;\n";
            cout << "list all - Показать весь список;\n";
            cout << "list completed - Показать только выполненные задачи;\n";
            cout << "list active - Показать активные задачи;\n";
            cout << "remove \"Номер задачи\" - Удалить задачу.\n";
            cout << "clear - Удалить весь список.\n";
            cout << "clear completed - Удалить только выполненные задачи.\n";
            cout << "close - Закрыть приложение.\n";
        }
        else if (cmd.nameCommand == "save")
            myList.saveList(cmd.file);
        else if (cmd.nameCommand == "load")
            myList.loadList(cmd.file);
        else if (cmd.nameCommand == "edit")
            myList.editTask(atoll(cmd.stringId.c_str()));
        else if (cmd.nameCommand == "close")
        {
            myList.saveList(AUTO_SAVE_NAME_FILE);
            return 0;
        }
        else
            cout << "Некорректная команда.\n";

        //Очистка буффера
        cmd = {};
    }
}