/*------------------------------------------------------------------------------
        Заголовки
-------------------------------------------------------------------------------*/
#include "parsing.h"
#include <iostream>

/*------------------------------------------------------------------------------
        Локальные определения - макросы
-------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
        Глобальные переменные - volatile
-------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
        Внешние переменные - extern
-------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
        Локальные переменные
-------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
        Локальные функции (объявления) - static
-------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
        Локальные функции (реализация) - static
-------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
        Глобальные функции
-------------------------------------------------------------------------------*/
Command parsingInputCmd(const string& command)
{
    Command cmd;
    bool isName = false;
    
    for (const auto& letter : command)
    {
        if (letter != ' ' && !isName)
        {
            cmd.nameCommand += letter;
        }
        else if (letter == ' ' && !isName)
        {
            isName = true;
            continue;
        }

        if ((cmd.nameCommand == "add" || cmd.nameCommand == "find" || cmd.nameCommand == "close") && isName)
            cmd.task += letter;
        else if ((cmd.nameCommand == "save" || cmd.nameCommand == "load") && isName)
            cmd.file += letter;
        else if ((cmd.nameCommand == "list" || cmd.nameCommand == "clear") && isName)
            cmd.status += letter;
        else if ((cmd.nameCommand == "complete" || cmd.nameCommand == "remove" || cmd.nameCommand == "edit") && isName)
            cmd.stringId += letter;
    }

    return cmd;
}